app/controllers/api/songs_controller.rb

    def toggle_like
        @song = Song.find(params[:id])
        @liked_songs = current_user.liked_songs
        unless @song.liked_by_user?(current_user)
            @like = current_user.likes.new(likeable_id: @song.id, likeable_type: 'Song')
            if @like.save
                render 'api/likes/index'
            else
                render json: ['Cannot process your request'], status: :unprocessable_entity
            end
        else
            @like = current_user.likes.find_by(likeable_id: @song.id, likeable_type: 'Song')
            @like.destroy
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 33], ["likeable_type", "Song"], ["likeable_id", 27], ["created_at", "2020-11-25 13:21:48.753899"], ["updated_at", "2020-11-25 13:21:48.753899"]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."likeable_id" = $2 AND "likes"."likeable_type" = $3 LIMIT $4  [["user_id", 33], ["likeable_id", 27], ["likeable_type", "Song"], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 6]]