app/views/api/artists/show.json.jbuilder

SELECT "songs".* FROM "songs" INNER JOIN "albums" ON "songs"."album_id" = "albums"."id" WHERE "albums"."artist_id" = $1  [["artist_id", 2]]
---
json.songs do
    @artist.songs.each do |song|

SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = $1  [["artist_id", 2]]
---
json.albums do
    @artist.albums.each do |album|