app/views/api/albums/show.json.jbuilder

SELECT "songs".* FROM "songs" WHERE "songs"."album_id" = $1  [["album_id", 3]]
---
json.songs do
    @album.songs.each do |song|