app/models/song.rb

    def liked_by_user?(user)
        query = Like.where(likeable_type: 'Song').where(likeable_id: self.id).where(user_id: user.id)
        !query.empty?
---
SELECT  1 AS one FROM "likes" WHERE "likes"."likeable_type" = $1 AND "likes"."likeable_id" = $2 AND "likes"."user_id" = $3 LIMIT $4  [["likeable_type", "Song"], ["likeable_id", 27], ["user_id", 33], ["LIMIT", 1]]